[
  {
    "id": "1",
    "name": "Starlink 9",
    "description": "A SpaceX Falcon 9 rocket is expected to launch the tenth batch of approximately 60 satellites for SpaceX’s Starlink broadband network, a mission designated Starlink 9. Two Earth observation microsatellites for BlackSky Global, a Seattle-based company, will launch as rideshare payloads on this mission.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
  "id": "2",
  "name": "Anasis 2",
  "description": "A SpaceX Falcon 9 rocket will launch the Anasis 2, or KMilSatCom 1, communications satellite for the South Korean military. The spacecraft was built by Airbus Defense and Space.",
  "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "3",
    "name": "Atlas 5 Mars 2020",
    "description": "Will launch NASA’s Mars 2020 rover to the Red Planet. After landing in February 2021, the Mars 2020 rover will study Martian geology, search for organic compounds, demonstrate the ability to generate oxygen from atmospheric carbon dioxide, and collect rock samples for return to Earth by a future mission.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "4",
    "name": "Starlink 10/SkySats 19-21",
    "description": "A SpaceX Falcon 9 rocket will launch 58 satellites for SpaceX’s Starlink broadband network, a mission designated Starlink 10. Three SkySat Earth-imaging satellites for Planet will launch as rideshare payloads on this mission.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "5",
    "name": "SXM 7",
    "description": "A SpaceX Falcon 9 rocket will launch the SXM 7 satellite for SiriusXM. The satellite will replace the XM 3 satellite in SiriusXM’s fleet providing satellite radio programming to consumers across North America. SXM 7 was built by Maxar Technologies, and features a large unfurlable S-band reflector to broadcast radio signals to users on the ground.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "6",
    "name": "GPS 3 SV04",
    "description": "A SpaceX Falcon 9 rocket will launch the U.S. Air Force’s fourth third-generation navigation satellite for the Global Positioning System.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "7",
    "name": "",
    "description": "",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "8",
    "name": "ULA Delta 4",
    "description": "A United Launch Alliance Delta 4-Heavy rocket will launch a classified spy satellite cargo for the U.S. National Reconnaissance Office. The largest of the Delta 4 family, the Heavy version features three Common Booster Cores mounted together to form a triple-body rocket. Delayed from June.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "9",
    "name": "Crew 1",
    "description": "A SpaceX Falcon 9 rocket will launch a Crew Dragon spacecraft on its first operational flight with astronauts on-board to the International Space Station. NASA astronauts Mike Hopkins, Victor Glover and Shannon Walker, and Japanese astronaut Soichi Noguchi will launch on the Crew Dragon spacecraft. The Crew Dragon will return to a splashdown at sea.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "10",
    "name": "NROL-101",
    "description": "A United Launch Alliance Atlas 5 rocket will launch a classified spacecraft payload for the U.S. National Reconnaissance Office.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "11",
    "name": "CRS 21",
    "description": "A SpaceX Falcon 9 rocket will launch a Dragon 2 spacecraft on its first cargo resupply mission to the International Space Station.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "12",
    "name": "Expedition 64 Launch",
    "description": "NASA astronaut Kate Rubins and cosmonauts Sergey Ryzhikov and Sergey Kud-Sverchkov of the Russian space agency Roscosmos launch aboard a Soyuz spacecraft to the International Space Station. This will be the second spaceflight for Rubins.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "13",
    "name": "Mars Perseverance Rover",
    "description": "Our Perseverance rover will search for signs of habitable conditions on Mars in the ancient past and for signs of past microbial life itself. The rover will launch on a United Launch Alliance Atlas V rocket from Space Launch Complex 41 at Cape Canaveral Air Force Station.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  },
  {
    "id": "14",
    "name": "Expedition 63 Landing",
    "description": " NASA astronaut Chris Cassidy and Russian space agency Roscosmos cosmonauts Anatoly Ivanishin and Ivan Vagner return to Earth aboard their Soyuz spacecraft, landing in Kazakhstan.",
    "_class": "com.raczkowska.springperformance.LaunchBlock"
  }
]
